{"posts":[{"title":"201810碎碎念","text":"最近跟朋友聊是否进大公司，经过这些年，我给的建议有些变化 经历了多次创业，为什么创业？曾经是这么算的，工作30年，每年20万年薪，总的600万，买房100万，买车50万…工作30年后身边有50万，如果中间能有其他增量，那么就会结余更多。 如今的建议是： 1、平均速度最重要：和开车一样，都是那个目标（财富值），高架你可以跑得快，下高架进入市区道路跑得慢，到达目的地后，发现平均速度很低，哪怕从杭州跑到老家，全程95%的高速，也只有60~70的平均速度。 2、按年裂变理论上长期呆在一家公司，每年公司都能为你涨薪10%~15%，这是复利。爱因斯坦爷爷的话，复利很可怕。 3、赚钱的老板比较少阿里P7，P8那年薪，多创业者一年忙到尾都拿不到的分红。 4、创业难没想象的那么光鲜，你能挣点钱，擦边球一般是绕不开的额；大部分盘子越大，负债越大；人与人之间的信任成本太大，优秀合作的团队少。不注意就给儿女带去些负面的影响。","link":"/2018/10/21/201810%E7%A2%8E%E7%A2%8E%E5%BF%B5/"},{"title":"2018年总结，2019年愿望","text":"2018家庭感谢老天给了我一个明大事、聪慧的老婆！ 楠芯慢慢会走路了， 会叫爸爸妈妈了。对于宝宝，就一个愿望：健康！ 因为过去几年的创业尝试，财富没有得到增长，甚至下滑。老婆也尝试了新的创收方式。 爸爸妈妈的养老保险都全额买上了，想想以后老爹能有钱买烟抽，老妈有钱给她孙子孙女买糖买衣服，也就不觉得现在辛苦了。 工作.产品路尝试培养去培养产品经理，把自己优化的工作方式授人以鱼。 这里主要指的是工作方式， 和对业务、功能的思考方式。 自己也深知离运营类产品经理有些距离，这方面暂时没有机会锻炼，也就没有去指导的机会了。 结果：还不错，能迅速培养起来。 工作.技术路上面提到的产品方向，都是2013~2016的学习成果，20170718转了技术。2018收获最大的是：尝试带队完成了多语种的项目，其中包含技术栈： PHP、Python Android、AWT React全家桶 Vue全家桶 小程序 C++客户端 Android APP的逆向和PC客户端的逆向 经常给团队开玩笑说，大家要有信心，我去年才重新回到技术这条路上，一样不带队完成这么大的项目。 2019家庭 楠芯宝宝健康成长！ 期望老婆能有时间和金钱，对自己好一点！ 全家健康！全家运动！ 去一趟云南或者西藏旅游！ 工作为了巩固自己技术这条路欠下的， 2019计划： 深入理解Laravel、理解PHP内核 Mysql内核理解及基于自身业务的优化 深入理解Linux和Windows底层 JAVA的SSH到微服务 GO语言内核 数据结构深入学习 60个算法题 建立当前阶段自己的团队管理理论体系","link":"/2019/01/02/2018%E5%B9%B4%E6%80%BB%E7%BB%93%EF%BC%8C2019%E5%B9%B4%E6%84%BF%E6%9C%9B/"},{"title":"2018剩余时间的学习计划","text":"10年6月开始，之后几年管理啊，几年的产品，2017年7月再次进入编码。 做产品时，看写代码的人那是真着急 蜜蜂有货，自己觉得累了，就想在家附近找个工作，写写代码，陪陪家人。 薪水也还能养活家人 老婆一直觉得我不是做产品的料，是写代码的料 后来出来做一页互动，开始是TP5，之间经历过一段时间的传统MVC和前后端分离共存的研发状态。主要是最开始没想到要高出那么多端，后来windows、android、小程序端陆续出来，后重构。后端改成了Lumen重写，改成了统一的接口。 经历了这一年的起起落落（产品和事业上），看到日新月异的代码行业，真想骂娘。 杭州原来崇尚PHP的有赞也转投JAVA怀抱，满世界找JAVA的人才。我也计划在PHP深入的同时，重新把JAVA捡起来。10000小时定理，打算缩小到5000小时，大概是2年的时间，对很多核心的、基础的、底层的技术巩固复习，同时拓展新知识。因此指定计划，该计划会一季度调整一次。 《疯狂Java讲义》10月~11月，选了一段时间，发现这本书基础讲解比较好，也容易懂。 《码出高效，Java开发手册》 11月，阿里最新书籍，很多知识具有贯穿性，也相对比较基础。 《Java并发编程的艺术》，待定","link":"/2018/10/08/2018%E5%89%A9%E4%BD%99%E6%97%B6%E9%97%B4%E7%9A%84%E5%AD%A6%E4%B9%A0%E8%AE%A1%E5%88%92/"},{"title":"搭建面向非洲的独立站调研(一)","text":"项目背景广告主为各个分销人员（接流员）投流，在 facebook 投流，线索引流到 WhatsApp，然后转化，2种路径： 直接索要联系地址，货到付款 发送商城的商品链接，客户自助下单，链接需要识别到是哪个分销人员带来成交的，客户与分销人员的关系绑定是终身的。后续这个买家的订单如果能识别出推荐人的，就绑推荐人，如果识别不出推荐人的，就自动关联上行绑定的分销人员。 调研内容 每个接流员有自己独立的推广链接 每个团长/接流员可以查看自己的推广情况 调研结果 shopify 中有个折扣，可以为每个接流员创建1个折扣码，折扣码会体现在订单中 三方的工具搜了下， 没有能支持接流员和团长查看自己业绩的工具，这部分需要自己开发 其他收获 shopify 的默认试用时长设定的是3天 下一步行动 准备开通开发者，获取订单信息，开发后面的团长管理系统","link":"/2025/01/07/%E6%90%AD%E5%BB%BA%E9%9D%A2%E5%90%91%E9%9D%9E%E6%B4%B2%E7%9A%84%E7%8B%AC%E7%AB%8B%E7%AB%99-%E4%B8%80/"}],"tags":[{"name":"计划与总结","slug":"计划与总结","link":"/tags/%E8%AE%A1%E5%88%92%E4%B8%8E%E6%80%BB%E7%BB%93/"},{"name":"shopify","slug":"shopify","link":"/tags/shopify/"},{"name":"独立站","slug":"独立站","link":"/tags/%E7%8B%AC%E7%AB%8B%E7%AB%99/"}],"categories":[],"pages":[]}